import React from "react";
import Tab from "react-bootstrap/Tab";
import Tabs from "react-bootstrap/Tabs";
import "./TabsSection.css";
import { FaClipboardList } from "react-icons/fa";
const TabSection = () => {
  return (
    <div className="tabs">
      <div className="container">
        <div className="row">
          <Tabs defaultActiveKey="profile" id="justify-tab-example" className="mb-3 " justify>
             

            <Tab eventKey="প্রাথমিক নীতিমালা" title="প্রাথমিক নীতিমালা"> 
              
              <ul className="PrimaryRules">
                <li>লাইব্রেরির নিয়ন্ত্রণ ও পরিচালনায় থাকবে মসজিদ কমিটি ও নির্দিষ্ট প্রতিনিধি।</li>
                <li>মসজিদের মুয়াজ্জিনের মাধ্যমে যেকোন পাঠক নির্দিষ্ট সময়ে বই সংগ্রহ করতে পারবেন</li>
                <li>
                  সপ্তাহের প্রতি জুমাবার নির্দিষ্ট ব্যক্তি বা প্রতিনিধির মাধ্যমে বই সংগ্রহ করতে পারবেন। পাঠক এটা
                  নির্দিষ্ট সময় পর্যন্ত নিজের হেফাজতে রেখে পড়তে পারবেন (৭ দিন)। এক্ষেত্রে পাঠকের জন্য নির্ধারিত শর্ত
                  প্রযোজ্য হবে।
                </li>
                <li>
                  প্রাথমিকভাবে লাইব্রেরি কার্ড ছাড়া বই পড়তে ও সংগ্রহ করতে পারবেন। তবে অবশ্যই অবশ্যই লাইব্রেরি কার্ডের
                  মাধ্যমে বই সংগ্রহ করতে হবে। নির্দিষ্ট ফরমেটে লাইব্রেরি কার্ড পাঠাগারে যুক্ত থাকবে।
                </li>
                <li>
                  মহিলারা তাঁর প্রতিনিধির মাধ্যমে বই সংগ্রহ করতে পারবেন। বাড়িতে বসেই পড়তে পারবেন। - ধর্মপ্রাণ
                  শিক্ষানুরাগী ও বইপ্রেমী হিসাবে যেকোন ব্যক্তি বই অনুদান দিতে পারবেন। তবে সেটা কর্তৃপক্ষের অনুমতি
                  সাপেক্ষে। বই অনুদান অবশ্যই শর্তহীনভাবে হতে হবে।
                </li>
              </ul>
            </Tab>
            <Tab eventKey="পাঠকের করণীয় বা নীতিমালা" title="পাঠকের করণীয় বা নীতিমালা">
              <ul className="rulesOfReader">
                <li>১। বই সংগ্রহের জন্য অবশ্যই রেজিস্ট্রার খাতায় বা অনলাইন ফর্মে উল্লেখিত তথ্য দিতে হবে।</li>
                <li> ২। একজন নতুন পাঠক একবারে সর্বোচ্চ একটি বই নিতে পারবেন।</li>
                <li>
                  {" "}
                  ৩। প্রতিটি বইয়ের জন্য সর্বোচ্চ ৭ দিন সময় নিতে পারবেন। এই সময়ের মধ্যেই বই পাঠাগারে জমা দিতে হবে।
                </li>
                <li>
                  {" "}
                  ৪। উল্লেখিত সময়ের মধ্যে বই জমা প্রদানে ব্যর্থ হলে উক্ত সময়ের মধ্যেই কর্তৃপক্ষের সাথে যোগাযোগ করবেন।
                </li>
                <li>
                  ৫। পাঠক সংগৃহীত বই নিজের বইয়ের মত যত্ন করবেন। কোন ধরনের ক্ষতি থেকে সাবধানে রাখবেন। মনে রাখবেন বইটি
                  ফেরতের পূর্ব পর্যন্ত এটি আপনার কাছে আমানত স্বরূপ।
                </li>
                <li>
                  ৬। বইয়ের পৃষ্ঠা ভাঁজ দিয়ে কোন চিহ্ন দেয়া যাবে না। তবে কোন কাগজ বা ফিতা দিয়ে বুকমার্ক করতে পারেন।
                  কলম বা পেন্সিল দিয়ে কোন ধরনের দাগ দেয়া যাবে না। আপনার প্রয়োজনীয় অংশটুকু খাতায় লিখে রাখুন।
                </li>
                <li>
                  ৭। অনাকাঙ্ক্ষিতভাবে কোন ক্ষতি হলে যেমন- কোন পৃষ্ঠা বা পৃষ্ঠাংশ ছিড়ে গেলে, পানি পরে গেলে অথবা হারিয়ে
                  গেলে কর্তৃপক্ষের নিকট যোগাযোগ করুন। এক্ষেত্রে কর্তৃপক্ষের সিদ্ধান্তই চূড়ান্ত বলে বিবেচিত হবে।
                </li>
                <li>
                  {" "}
                  ৮। আপনার পঠিত বইগুলোর উপর আপনার অনুভূতি বা রিভিউ পোস্ট করতে পারেন আমাদের পাঠাগার গ্রুপে। ৯। পাঠক
                  কর্তৃপক্ষের কাছে নিজের পছন্দের বই লাইব্ররিতে যুক্ত করার আবেদন করতে পারেন। এক্ষেত্রে কর্তৃপক্ষ সার্বিক
                  বিবেচনা ও সিদ্ধান্ত নিবেন।
                </li>
              </ul>
            </Tab>

            <Tab eventKey="যোগাযোগ" title="যোগাযোগ">
              <ul className="contact">
                <li>অথবা কল: ছদাহা ফজুর পাড়া, ছদাহা, সাতকানিয়া (২ নং ওয়ার্ড)।</li>
              </ul>
            </Tab>
            <Tab eventKey="ঠিকানা" title="ঠিকানা">
              <ul className="contact">
                <li>ঠিকানা: ছদাহা ফজুর পাড়া, ছদাহা, সাতকানিয়া (২ নং ওয়ার্ড)।</li>
              </ul>
            </Tab>
          </Tabs>
        </div>
      </div>
       <button className= "library"> <a href="https://digitallibrary.chadaha.com/libraries">পাঠাগারের সব বই দেখতে ক্লিক করুন </a></button>
    </div>
  );
};

export default TabSection;
